package main.java.core.level01.task11;

/**
 * Вы хотите временно отключить большой блок кода, чтобы протестировать другую часть программы.
 * Используйте один многострочный комментарий, чтобы заблокировать все команды в программе. Программа не должна выводить ничего на экран.
 * Требования:
 * •	В программе должен быть использован один многострочный комментарий для отключения блока кода.
 * •	Все команды в программе должны быть закомментированы с помощью одного многострочного комментария.
 * •	Программа не должна выводить ничего на экран при запуске.
 */
public class Task11 {

    /*
    // Пример объявления переменной типа int
      int number = 10;

        // Пример объявления переменной типа String
        String text = "Привет, мир!";

        // Пример вывода переменных на экран
        System.out.println(number);
        System.out.println(text);
        */
}
