package main.java.core.level02.task13;

/**
Представьте, что вы создаёте игру и хотите задать возраст главного героя.
Объявите переменную типа int с именем heroAge и присвойте ей значение 25. Выведите это значение на экран. Создание и присваивание должно быть выполнено в одной строке.
Требования:
•	В программе должна быть объявлена переменная типа int.
•	Переменная должна иметь имя heroAge.
•	Переменная heroAge должна быть инициализирована значением 25 непосредственно при объявлении (в одной строке).
•	Значение переменной heroAge должно быть выведено на экран.
 */
public class Task13 {
    public static void main(String[] args) {

        int heroAge =25;
        System.out.println(heroAge);
    }
}
