package main.java.core.level01.task12;

/**
 * Вам дали код, который не компилируется. Найдите и закомментируйте все строки, которые вызывают ошибки или выводят что-то в консоль.
 * Программа должна запускаться без проблем и не выводить ничего в консоль.

 * Требования:
 * •	Все найденные строки с ошибками компиляции должны быть закомментированы с помощью //.
 * •	В программе запрещено вносить любые другие изменения, кроме добавления комментариев для закомментирования ошибочных строк.
 * •	После внесения изменений программа должна успешно компилироваться без ошибок.
 * •	Программа не должна выводить ничего в консоль после исправления.
 */
public class Task12 {

    int number = 10;
    // int number = 20;

    int uninitialized;
    //System.out.println(uninitialized);

    //String text = 123;

    //System.out.println(undeclaredVariable);

    // System.out.println(number);
}
