package main.java.core.level03.task41;

/**
 * Вы пишете программу, чтобы проверить правдивость утверждения. Создайте переменную типа boolean с именем isJavaFun и присвойте ей значение true.
 * Выведите это значение на экран.
 * Требования:
 * •	В программе должна быть объявлена переменная типа boolean с именем isJavaFun.
 * •	Переменной isJavaFun должно быть присвоено значение true.
 * •	Программа должна вывести на экран значение переменной isJavaFun.
 * •	В коде не должно быть попыток использовать другие типы данных для переменной isJavaFun.
 */
public class Task41 {
    public static void main(String[] args) {
    boolean isJavaFun = true;
        System.out.println(isJavaFun);

    }
}
