package main.java.core.level01.task10;

/**
Представьте, что вы оставляете комментарии в коде для своей команды. Используйте однострочные комментарии, чтобы заблокировать выполнение всех команд в программе.
 В результате, программа не должна ничего выводить на экран.
 Требования:
•	В коде должны использоваться однострочные комментарии (//) для комментирования строк.
•	Все команды в программе должны быть закомментированы с помощью однострочных комментариев.
•	В результате выполнения программы не должно быть никакого вывода на экран.
 */
public class Task10 {

    // Объявляем переменную типа int и присваиваем ей значение 10
    // int number = 10;

    // Объявляем переменную типа String и присваиваем ей значение "Hello, World!"
    // String message = "Hello, World!";

    // Выводим значение переменной number на экран
    //System.out.println(number);

    // Выводим значение переменной message на экран
    // System.out.println(message);
}
