package main.java.core.level07.task121;

/**
 * Размещение приветственного сообщения на информационном табло 📢
 * Вы программируете большое цифровое информационное табло, которое представляет собой сетку из 3 строк и 2 столбцов, где каждая ячейка может отображать короткое сообщение.
 * Ваша задача — разместить приветственное сообщение "Hello" именно на самой последней панели табло (которая с точки зрения программирования соответствует третьей строке и второму столбцу).
 * После того как сообщение установлено, вам нужно убедиться, что оно появилось точно в этом месте.
 * Создайте двумерный массив String[][] displayGrid размером 3 строки и 2 столбца.
 * Присвойте элементу, расположенному в третьей строке и втором столбце, значение "Hello".
 * Затем выведите этот элемент на экран, чтобы подтвердить, что сообщение отображается корректно.
 * Требования:
 * •	Необходимо создать двумерный массив типа String с именем displayGrid размером 3 строки и 2 столбца.
 * •	Требуется присвоить значение "Hello" элементу массива, который находится в третьей строке и втором столбце (индексы 2 и 1).
 * •	Необходимо вывести на экран значение элемента displayGrid, находящегося в третьей строке и втором столбце.
 * •	При обращении к элементу массива должны быть использованы корректные индексы (нумерация с нуля).
 */
public class Task121 {
    public static void main(String[] args) {
    String[][] displayGrid = new String[3][2];
    displayGrid[2][1] = "Hello";
        System.out.println(displayGrid[2][1]);
    }
}
